import { defineStore } from 'pinia'

import img_1 from '@/assets/images/blog/img_1.png'
import img_2 from '@/assets/images/blog/img_2.png'
import img_3 from '@/assets/images/blog/img_3.png'
import img_4 from '@/assets/images/blog/img_4.png'
import img_5 from '@/assets/images/blog/img_5.png'
import img_6 from '@/assets/images/blog/img_6.png'
export const useBlogsStore = defineStore('blogsStore', {
  state: () => ({
    articles: [
      {
        id: 1,
        title: 'Як обрати горщик для кімнатної рослини',
        data: '12/08/2024',
        img: img_1,
        header:
          'Правильний вибір горщика для кімнатної рослини — це не тільки питання естетики, але й важливий аспект здоров’я вашої зеленої підопічної. Розмір, матеріал і навіть форма горщика впливають на ріст та розвиток рослини. У цій статті розглянемо основні критерії, які варто врахувати при виборі горщика.',
        subtitles: ['Розмір горщика', 'Наявність дренажу', 'Форма горщика', 'Естетика'],
        desc: [
          [
            'Розмір горщика є ключовим фактором для здоров’я рослини. Якщо горщик занадто малий, коренева система не зможе розвиватися, що призведе до зупинки росту або навіть загибелі рослини.',
            'З іншого боку, занадто великий горщик може викликати застій вологи в ґрунті, що призводить до гниття коренів. Загальне правило: новий горщик повинен бути на 2-3 см більшим за діаметр кореневої грудки.'
          ],
          [
            "Дренажні отвори на дні горщика є обов'язковими для більшості рослин. Вони забезпечують відтік зайвої води і допомагають запобігти загниванню коренів. ",
            'Якщо ви вибираєте декоративний горщик без дренажу, варто використовувати його як кашпо — ставити всередину основний горщик з дренажними отворами.'
          ],
          [
            'Форма горщика також може впливати на ріст рослини. Високі та вузькі горщики підходять для рослин з глибокою кореневою системою, таких як пальми чи фікуси.',
            'Широкі та неглибокі горщики більше підходять для сукулентів або кактусів, оскільки вони мають поверхневу кореневу систему.'
          ],
          "Звісно, важливо також обрати горщик, який гармоніюватиме з інтер'єром вашого дому. Кольори, текстури і форми повинні доповнювати загальний стиль приміщення та створювати приємну атмосферу."
        ],
        conclusion:
          'Обираючи горщик для кімнатної рослини, варто враховувати не лише зовнішній вигляд, але й функціональність. Збалансований вибір забезпечить рослині оптимальні умови для зростання, а вам — задоволення від споглядання здорової зеленої краси у вашому домі.'
      },
      {
        id: 2,
        title: 'Органічні добрива для кімнатних рослин як використовувати',
        data: '04/09/2024',
        img: img_2,
        header:
          'Кімнатні рослини, як і будь-які інші, потребують поживних речовин для здорового росту та розвитку. Одним із найкращих способів забезпечити їх усім необхідним є використання органічних добрив. Вони не тільки живлять рослини, але й поліпшують структуру ґрунту, що сприяє загальному покращенню умов вирощування.',
        subtitles: [
          'СЩо таке органічні добрива?',
          'Переваги органічних добрив',
          'Часті помилки при використанні добрив',
          'Слідкуйте за реакцією рослин'
        ],
        desc: [
          'Органічні добрива виготовляються з природних матеріалів — залишків рослинного або тваринного походження, компосту, гною, водоростей тощо. Вони містять макро- та мікроелементи, необхідні для росту рослин, у більш натуральній формі, що забезпечує поступове і тривале їх засвоєння.',
          [
            'Органічні добрива не містять хімічних речовин, тому вони є безпечними для довкілля та не шкодять рослинам навіть при надмірному використанні.',
            'Органічні добрива діють повільніше, але забезпечують тривале живлення рослин, оскільки поступово розкладаються в ґрунті.'
          ],
          [
            'Багато людей вважають, що чим більше добрив, тим краще. Однак надмірне підживлення може пошкодити корені та викликати проблеми зі здоров’ям рослин.',
            'Деякі рослини потребують більше поживних речовин, інші — менше. Завжди варто враховувати індивідуальні потреби вашої зеленої підопічної.'
          ],
          'Рослини реагують на добрива по-різному. Якщо ви помічаєте уповільнення росту або інші ознаки дискомфорту, можливо, варто зменшити кількість добрив або спробувати інший тип органіки.'
        ],
        conclusion:
          'Органічні добрива — це чудовий спосіб забезпечити здоровий ріст кімнатних рослин, поліпшити якість ґрунту і зробити ваше рослинне оточення екологічнішим. Вони безпечні для використання, економічні та допомагають досягти тривалого результату.Доглядайте за своїми рослинами правильно, використовуючи натуральні добрива, і вони відповідатимуть вам рясним зростанням та яскравим виглядом!'
      },
      {
        id: 3,
        title: 'Топ-10 невибагливих кімнатних рослин для початківців',
        data: '18/09/2024',
        img: img_3,
        header:
          'Ви мрієте про зелений оазис у своїй квартирі, але не впевнені, з чого почати? Кімнатні рослини можуть прикрасити ваш дім і покращити якість повітря, а також створити затишну атмосферу. Для початківців важливо обрати рослини, які не вимагають особливого догляду та легко пристосовуються до різних умов.',
        subtitles: [
          'Сансевієрія (Щучий хвіст)',
          'Спатіфілум (Жіноче щастя)',
          'Хлорофітум (Зелена лілія)',
          'Кактус',
          'Грошове дерево',
          'Заміокулькас',
          'Пеперомія',
          'Фікус еластика (Каучукове дерево)',
          'Драцена',
          'Плющ звичайний'
        ],
        desc: [
          'Сансевієрія, відома як "щучий хвіст", є ідеальною рослиною для зайнятих людей. Ця рослина також відома своїми очисними властивостями – вона покращує якість повітря у приміщенні.',
          'Спатіфілум добре росте в затінених куточках квартири і потребує помірного поливу. Вона також очищує повітря від шкідливих речовин, що робить її чудовим вибором для дому або офісу.',
          'Хлорофітум вважається однією з найстійкіших рослин, яку важко знищити. Він може рости навіть у слабко освітлених місцях і не потребує частого поливу.',
          'Кактуси добре переносять сухе повітря і потребують мінімального догляду, можуть рости як на яскравому сонці, так і в півтіні. Поливати їх варто лише раз на кілька тижнів.',
          'Вона любить яскраве розсіяне світло і не потребує частого поливу, адже накопичує воду у своїх товстих листках. Вважається символом удачі.',
          'Ця рослина має блискучі зелені листки і може витримати майже будь-які умови. Заміокулькас легко переносить відсутність сонця і може довго обходитися без води, тому його часто рекомендують початківцям.',
          'Вона любить затінені місця і потребує мінімального поливу. Її можна вирощувати навіть у маленьких приміщеннях або на підвіконнях, де мало світла.',
          'Вона має великі, блискучі листки, які додають приміщенню стильного вигляду. Фікус також допомагає очищати повітря, роблячи його свіжішим.',
          'Драцена — це прекрасний вибір для початківців. Вона добре переносить слабке освітлення і нерегулярні поливи. Її вузькі, довгі листки створюють цікавий акцент у кімнаті, додаючи рослинної свіжості.',
          'Витка рослина, яка легко адаптується до різних умов, добре росте як у світлих, так і у затінених місцях і не потребує складного догляду. Швидко розростається і може красиво обвивати підставки або стіни.'
        ],
        conclusion:
          "Обирайте ці рослини для свого дому, і навіть якщо ви новачок у світі кімнатного озеленення, вони обов'язково стануть чудовою прикрасою і не вимагатимуть складного догляду."
      },
      {
        id: 4,
        title: 'Як правильно поливати кімнатні рослини',
        data: '19/10/2024',
        img: img_4,
        header:
          "Правильний полив — це один із найважливіших аспектів догляду за кімнатними рослинами. Більшість рослин гинуть не від нестачі, а від надлишку води, тому важливо знати, як забезпечити оптимальні умови для їх росту. У цій статті ми розглянемо основні правила поливу, які допоможуть зберегти здоров'я ваших кімнатних рослин.",
        subtitles: [
          'Орієнтуйтесь на потреби рослини',
          'Перевіряйте ґрунт перед поливом',
          'Використовуйте воду кімнатної температури',
          'Спостерігайте за станом рослини'
        ],
        desc: [
          'Кожна рослина має свої індивідуальні потреби в поливі. Деякі, як-от кактуси чи сукуленти, люблять сухі умови і потребують дуже рідкісного поливу, тоді як інші, наприклад, папороті або тропічні рослини, люблять вологу. Тому перший крок — дізнатися про конкретні вимоги вашої рослини.',
          [
            'Перед поливом важливо перевірити, наскільки ґрунт сухий. Ви можете легко зробити це за допомогою пальця, зануривши його на 2-3 см у ґрунт.',
            'Якщо він ще вологий, рослина не потребує поливу. Якщо ж ґрунт сухий на глибині кількох сантиметрів, рослину можна полити. Це правило особливо важливе для сукулентів і кактусів.'
          ],
          [
            'Влітку кімнатні рослини зазвичай потребують більше води, оскільки в теплу пору року вони ростуть активніше. ',
            'Взимку ж, коли більшість рослин перебувають у стані спокою, слід зменшити частоту поливу. Однак важливо не забувати про них повністю, навіть у зимовий період.'
          ],
          [
            'Ознаки неправильного поливу легко розпізнати. Якщо листя жовтіє і опадає — це може бути сигналом про надмірний полив.',
            "Якщо листя в'яне або скручується, але ґрунт сухий — рослині не вистачає вологи. Регулярний огляд допоможе швидко реагувати на потреби рослини."
          ]
        ],
        conclusion:
          'Правильний полив — це основа догляду за кімнатними рослинами. Дотримуючись цих простих порад, ви забезпечите своїм зеленим улюбленцям здоровий і тривалий ріст. Головне — не перестаратися з поливом і завжди стежити за станом ґрунту та самої рослини. Полив повинен бути своєчасним і відповідати потребам конкретного виду.'
      },
      {
        id: 5,
        title: 'Як обрати ідеальне місце у вашому домі',
        data: '01/10/2024',
        img: img_5,
        header:
          "Правильний полив — це один із найважливіших аспектів догляду за кімнатними рослинами. Більшість рослин гинуть не від нестачі, а від надлишку води, тому важливо знати, як забезпечити оптимальні умови для їх росту. У цій статті ми розглянемо основні правила поливу, які допоможуть зберегти здоров'я ваших кімнатних рослин.",
        subtitles: [
          'Світло: сонячні та затінені місця',
          'Температура',
          'Вологість повітря',
          'Стиль інтер’єру'
        ],
        desc: [
          [
            'Світло — це головний фактор для фотосинтезу, тому кожній рослині потрібно обрати місце з урахуванням її світлових потреб.',
            'Якщо ви не впевнені, чи достатньо світла отримує ваша рослина, зверніть увагу на її листя. Якщо воно стає блідим і втрачає колір, це може бути ознакою нестачі світла.'
          ],
          'Температура в приміщенні також відіграє важливу роль. Більшість кімнатних рослин комфортно почуваються при температурі від 18 до 24°C. Важливо уникати різких перепадів температури та прямих протягів, адже вони можуть стресувати рослину.',
          [
            'Різні рослини мають різні вимоги до вологості. Тропічні рослини, такі як монстера або драцена, люблять вологе повітря, тоді як сукуленти і кактуси добре почуваються в сухих умовах.',
            'Якщо повітря у вашому домі дуже сухе, можна використовувати зволожувачі або обприскувати рослини водою для підтримки оптимальної вологості.'
          ],
          'Окрім функціональних потреб, рослини мають гармонійно вписуватися в інтер’єр вашого дому. Високі, розлогі рослини можуть стати головним акцентом кімнати, а невеликі зелені акценти прикрасять робочий стіл або підвіконня.',
          'Важливо уникати місць, де рослини можуть зазнавати різких змін умов, таких як холодні протяги від вікон або дверей, надмірне сонячне світло чи близькість до обігрівачів.',
          'Різні рослини мають різні потреби у просторі. Наприклад, високі та розлогі рослини потребують більше місця, тому їх краще розміщувати на підлозі або в просторих кімнатах. Невеликі рослини можна поставити на підвіконня, полиці або робочі столи.'
        ],
        conclusion:
          'Правильний вибір місця для кімнатних рослин — це ключ до їхнього довгого і здорового життя. Враховуйте потреби кожної рослини у світлі, вологості та температурі, а також звертайте увагу на умови в вашому домі, щоб створити найкраще середовище для вашого зеленого друга. Оберіть ідеальне місце для рослини, і вона буде радувати вас своєю красою довгі роки.'
      },
      {
        id: 6,
        title: 'Практичні поради щодо догляду за рослинами',
        data: '05/10/2024',
        img: img_6,
        header:
          'Догляд за кімнатними рослинами може бути справжнім задоволенням, але для того, щоб ваші зелені улюбленці були здоровими і квітучими, варто знати кілька практичних правил. Незалежно від того, чи ви новачок у вирощуванні рослин, чи вже маєте певний досвід, ці поради допоможуть вам забезпечити правильний догляд за своїми кімнатними рослинами.',
        subtitles: [
          'Обрізайте сухе листя і квіти',
          'Регулярно провітрюйте приміщення',
          'Слідкуйте за станом ґрунту',
          'Боріться зі шкідниками природними методами',
          'Регулярно пересаджуйте рослини',
          'Слідкуйте за вологістю повітря'
        ],
        desc: [
          'Регулярна обрізка допомагає підтримувати здоровий вигляд рослини і стимулює її ріст. Видаляйте сухі або пошкоджені листки, а також відцвілі квіти, щоб рослина не витрачала на них енергію.',
          'Світло і вода важливі, але не варто забувати про свіже повітря. Провітрюйте кімнату, але уникайте протягів, які можуть нашкодити рослинам, особливо тропічним. Свіжий потік повітря допомагає уникати застою вологи і попереджає виникнення грибкових захворювань.',
          'З часом ґрунт може ущільнитися, що знижує доступ повітря до коренів. Регулярно розпушуйте верхній шар ґрунту, щоб забезпечити доступ кисню до кореневої системи.',
          'Регулярно оглядайте листя і стебла на наявність шкідників і вчасно вживайте заходів. Якщо ви помітили на своїх рослинах шкідників (павутинний кліщ, тля), використовуйте натуральні методи боротьби. ',
          'З часом рослини витягують всі поживні речовини з ґрунту, і їм стає тісно у старому горщику. Тому пересадка — це важливий етап догляду. Якщо рослину важко пересадити, можна просто замінити верхній шар ґрунту на свіжий.',
          'Деякі кімнатні рослини, особливо тропічні (монстера, філодендрон), потребують підвищеної вологості повітря. У зимовий період, коли працює опалення, повітря стає сухішим, і рослини можуть страждати.'
        ],
        conclusion:
          'Догляд за кімнатними рослинами — це не тільки полив і підгодівля, але й увага до їхніх потреб у світлі, вологості та повітрі. Дотримуючись цих практичних порад, ви зможете створити для своїх зелених улюбленців найкращі умови для росту та розвитку. І головне — не забувайте спостерігати за станом своїх рослин, адже вони завжди «розкажуть», що їм потрібно.'
      }
    ],
    selectedBlog: null
  }),
  actions: {
    getBlogById(id) {
      const blog = this.articles.find((blog) => blog.id === parseInt(id))
      if (blog) {
        this.selectedBlog = blog
      } else {
        console.error('Блог не знайдено')
      }
    }
  }
})
